In [1]:
from supabase import create_client
import pandas as pd, os
from dotenv import load_dotenv
load_dotenv()
supabase = create_client(os.getenv("SUPABASE_URL"), os.getenv("SUPABASE_KEY"))
data = supabase.table("titanic_data").select("*").execute()
df = pd.DataFrame(data.data)

In [2]:

df.head()

,id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alive,alone,who,adult_male,family_size,is_alone,fare_per_person,sex_encoded
0,1,0,3,male,22.0,1,0,7.2500,S,Third,C,Southampton,no,false,man,true,2,0,3.62500,1
1,2,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,yes,false,woman,false,2,0,35.64165,0
2,3,1,3,female,26.0,0,0,7.9250,S,Third,C,Southampton,yes,true,woman,false,1,1,7.92500,0
3,4,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,yes,false,woman,false,2,0,26.55000,0
4,5,0,3,male,35.0,0,0,8.0500,S,Third,C,Southampton,no,true,man,true,1,1,8.05000,1

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 20 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id               891 non-null    int64
 1   survived         891 non-null    int64
 2   pclass           891 non-null    int64
 3   sex              891 non-null    object
 4   age              891 non-null    float64
 5   sibsp            891 non-null    int64
 6   parch            891 non-null    int64
 7   fare             891 non-null    float64
 8   embarked         891 non-null    object
 9   class            891 non-null    object
 10  deck             891 non-null    object
 11  embark_town      891 non-null    object
 12  alive            891 non-null    object
 13  alone            891 non-null    object
 14  who              891 non-null    object
 15  adult_male       891 non-null    object
 16  family_size      891 non-null    int64
 17  is_alone         891 non-null    int64
 18  fare_per_person  891 non-null    float64
 19  sex_encoded      891 non-null    int64
dtypes: float64(3), int64(8), object(9)
memory usage: 139.3+ KB

In [4]:

df.isnull().sum()

id                 0
survived           0
pclass             0
sex                0
age                0
sibsp              0
parch              0
fare               0
embarked           0
class              0
deck               0
embark_town        0
alive              0
alone              0
who                0
adult_male         0
family_size        0
is_alone           0
fare_per_person    0
sex_encoded        0
dtype: int64

In [5]:

df.describe()

,id,survived,pclass,age,sibsp,parch,fare,family_size,is_alone,fare_per_person,sex_encoded
count,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.361582,0.523008,0.381594,32.204208,1.904602,0.602694,19.916375,0.647587
std,257.353842,0.486592,0.836071,13.019697,1.102743,0.806057,49.693429,1.613459,0.489615,35.841257,0.477990
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,22.000000,0.000000,0.000000,7.910400,1.000000,0.000000,7.250000,0.000000
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200,1.000000,1.000000,8.300000,1.000000
75%,668.500000,1.000000,3.000000,35.000000,1.000000,0.000000,31.000000,2.000000,1.000000,23.666667,1.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200,11.000000,1.000000,512.329200,1.000000

In [6]:

df.columns

Index(['id', 'survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'deck', 'embark_town', 'alive', 'alone', 'who',
       'adult_male', 'family_size', 'is_alone', 'fare_per_person',
       'sex_encoded'],
      dtype='object')